rescaling.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-11-11 Mon 16:42 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Pulsar Rescaling Guideline</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Chen">
<link rel="stylesheet" type="text/css" href="org.min.css" />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Pulsar Rescaling Guideline</h1>
</header>
<div id="outline-container-orge457c02" class="outline-2">
<h2 id="orge457c02"><span class="section-number-2">1</span> Rationale</h2>
<div class="outline-text-2" id="text-1">
<p>
The goal of this document is to formulate a way of rescaling the pulsar
parameters from realistic values to ones more feasible for a global simulation.
The emphasis will be placed on &ldquo;typical&rdquo; pulsars that are in the middle of the
radio pulsar population, with \(B_{0} \sim 10^{12}\,\mathrm{G}\), and period
\(P\sim 1\,\mathrm{s}\). What is special about these pulsars is that, as will be
evident in the following sections, curvature photons typically have macroscopic
free path even near the star. Studying how these pulsars behave will shed light
on how pulsars operate near the death line, and may eventually allow us to put
constraints on pulsar radio mechanisms.
</p>
</div>
</div>

<div id="outline-container-org7a82d40" class="outline-2">
<h2 id="org7a82d40"><span class="section-number-2">2</span> Basic Scales</h2>
<div class="outline-text-2" id="text-2">
<p>
For these pulsars, \(\gamma_\mathrm{thr}\) no longer makes sense. There is no real
&ldquo;threshold&rdquo; for pair production. The free path of curvature photons will scale
with their energies, and even at \(\gamma_\mathrm{pc}\), the emitted curvature
photon will not convert in the gap, indicating that voltage will extend beyond
\(\gamma_\mathrm{pc}\).
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Realistic</th>
<th scope="col" class="org-left">Simulation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Magnetic field</td>
<td class="org-left">\(B\sim 10^{12}\,\mathrm{G}\)</td>
<td class="org-left">\(\tilde{B}\sim 1.6\times 10^5\)</td>
</tr>

<tr>
<td class="org-left">Period</td>
<td class="org-left">\(P\sim 1\,\mathrm{s}\)</td>
<td class="org-left">\(P\sim 50R_{*}/c\)</td>
</tr>

<tr>
<td class="org-left">\(R_{LC}\)</td>
<td class="org-left">\(\sim 5000R_*\)</td>
<td class="org-left">\(8R_{*}\)</td>
</tr>

<tr>
<td class="org-left">\(\rho_{c}\) at last closed field line</td>
<td class="org-left">\(\sim 90R_{*}\)</td>
<td class="org-left">\(\sim 4R_{*}\)</td>
</tr>

<tr>
<td class="org-left">\(\gamma_{0}\)</td>
<td class="org-left">\(5.7\times 10^{10}\)</td>
<td class="org-left">\(\sim 2\times 10^4\)</td>
</tr>

<tr>
<td class="org-left">\(\gamma_\mathrm{pc}\)</td>
<td class="org-left">\(\sim 1.3\times 10^7\)</td>
<td class="org-left">\(\sim 2.5\times 10^3\)</td>
</tr>
</tbody>
</table>

<p>
The rest of the scales can become a bit tricky. Curvature photon energy, mean
free path for particles to emit curvature photons, and photon free path all
require some scaling. For example, the dimensionless free path is:
</p>

<p>
\[
\tilde{\ell}_\mathrm{curv} = \frac{9}{4\alpha}\frac{\rho_c}{R_{*}}\frac{1}{\gamma}
\]
</p>

<p>
This is the average distance a particle will travel before it emits a curvature
photon. Together with the typical curvature photon energy, it will determine the
curvature energy loss rate for particles in the magnetosphere. For realistic
particles at \(\gamma_\mathrm{pc}\), \(\tilde{\ell}_\mathrm{curv}\sim 2\times
10^{-3}\). For the simulation parameters the naive formula will give 0.5, which
is much larger than realistic values. Ideally we want to rescale it to \(\sim
10^{-2}\). However, this would very likely increase the curvature energy loss
rate by a huge factor, reducing the radiation limited Lorentz factor. Will be
considering this more in the next section.
</p>
</div>
</div>

<div id="outline-container-orgf1dc45f" class="outline-2">
<h2 id="orgf1dc45f"><span class="section-number-2">3</span> Numerical Parameters</h2>
<div class="outline-text-2" id="text-3">
<p>
At least three dimensionless numerical parameters can be independently tuned:
the characteristic curvature free path \(\tilde{\ell}_c\), the normalization for
curvature photon energy \(\tilde{\epsilon}_0\), and the normalization for photon
free path \(\tilde{\ell}_0\). As a result, the mean free path for curvature
emission will be:
</p>

<p>
\[
\tilde{\ell}_\mathrm{curv} = \tilde{\ell}_c \frac{\tilde{\rho}_c}{\gamma}
\]
</p>

<p>
The characteristic energy of curvature photons will be:
</p>

<p>
\[
\tilde{\epsilon}_c = \epsilon_0 \frac{\gamma^3}{\tilde{\rho}_c}
\]
</p>

<p>
And the mean free path for the curvature photons to convert to pairs can be
written as:
</p>

<p>
\[
\tilde{\ell}_\mathrm{ph} \sim \tilde{\ell}_0 \frac{\tilde{\rho}_c}{\epsilon_\mathrm{ph}}\frac{B_Q}{B}
\]
</p>

<p>
Note that this estimate assumes constant \(B\) field and constant radius of
curvature. In reality the free path is ultimately determined by the angle
between photon propagation and the local \(B\) field, and the above estimate is
just a crude approximation.
</p>

<p>
Here is a tentative choice for the 3 numerical parameters:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Realistic</th>
<th scope="col" class="org-left">Simulation</th>
<th scope="col" class="org-left">Reason</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">\(\tilde{\ell}_\mathrm{c}\)</td>
<td class="org-left">\(\sim 308\)</td>
<td class="org-left">want \(\sim 6\)</td>
<td class="org-left">want \(\tilde{\ell}_\mathrm{curv} \sim 0.01\) at \(\gamma_\mathrm{pc}\)</td>
</tr>

<tr>
<td class="org-left">\(\tilde{\epsilon}_0\)</td>
<td class="org-left">\(\sim 5.8\times 10^{-17}\)</td>
<td class="org-left">want \(\sim 6.4\times 10^{-9}\)</td>
<td class="org-left">want \(\epsilon_c=25\) at \(\gamma_\mathrm{pc}\) and \(\rho_c\)</td>
</tr>

<tr>
<td class="org-left">\(\tilde{\ell}_0\)</td>
<td class="org-left">\(\sim 0.1\)</td>
<td class="org-left">want \(\sim 0.05\)</td>
<td class="org-left">want similar free paths (\(\sim 0.1R_{*}\))</td>
</tr>
</tbody>
</table>

<p>
However these shouldn&rsquo;t be freely adjusted, since there are other constraints
that need to be satisfied.
</p>
</div>

<div id="outline-container-org00a58ea" class="outline-3">
<h3 id="org00a58ea"><span class="section-number-3">3.1</span> Lorentz factor when curvature radiation becomes quantum</h3>
<div class="outline-text-3" id="text-3-1">
<p>
When \(\epsilon_{c} \sim \gamma\), i.e. the curvature photon energy becomes
comparable to the emitting particle, then the curvature radiation formula can&rsquo;t
be used. The spectrum becomes truncated above \(\gamma - 1\). In reality, when
\(\gamma \sim \gamma_0\), \(\epsilon_c \sim 10^{12}\) which is way above \(\gamma_0\).
Quantum transition happens around \(\gamma \sim 1.2\times 10^9\) which is about
\(0.02\gamma_0\).
</p>

<p>
If we adopt the simulation parameters in the above table, then quantum
transition happens at around \(\gamma\sim 2.5\times 10^4\), which is slightly
above \(\gamma_0\). This may be a problem, but not a severe one if the particles
can&rsquo;t reach this energy anyway.
</p>
</div>
</div>

<div id="outline-container-org96a646e" class="outline-3">
<h3 id="org96a646e"><span class="section-number-3">3.2</span> Radiation reaction limit and energy loss rate</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To compute the radiation reaction limit, one equates the energy loss rate to
curvature radiation with the acceleration rate:
</p>

<p>
\[
\frac{\tilde{\epsilon}_c}{\tilde{\ell}_\mathrm{cur}} = \tilde{E}
\]
</p>

<p>
Plugging in the expressions from above, one can find that:
</p>

<p>
\[
\gamma_\mathrm{rad} = \left( \frac{\tilde{\ell}_c\tilde{\rho}^2_c}{\tilde{\epsilon}_0}\tilde{E} \right)^{1/4}
\]
</p>

<p>
This gives \(\gamma_\mathrm{rad} \sim 2\times 10^3\) for the numerical parameters
given above. It is comparable to \(\gamma_\mathrm{pc}\), which may pose a problem,
since in reality this number is close to 60 times \(\gamma_\mathrm{pc}\), right
between \(\gamma_\mathrm{pc}\) and \(\gamma_0\).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
